print("--- 001 関数 -------------------------------------------------------------")
def func001():
    print("001")
func001()

def func002():
    return("002")
print(func002())

def func003(num):
    return(num*3)
print(func003(5))

def func004():
    pass
func004()

def func005():
    return
print(func005())

print("--- 002 グローバル -------------------------------------------------------")
g_x = 100
def func006():
    # g_x = g_x * 10 # このコードは実行時エラーになる。g_xはイコールを使用した時点でローカルとなり、それを定義前に参照することになるため
    x = g_x
    x = x * 10
    print(x) 
func006()

print("--- 003 キーワード引数 ---------------------------------------------------")
def func007(x,y):
    return(x,y)
print(func007(y=100,x=200))

print("--- 004 デフォルト引数 ---------------------------------------------------")
def func008(x=100):
    return(x)
print(func008())

print("--- 005 可変引数 ---------------------------------------------------------")
def func009(*x):
    return(x)
print(func009(1,2,3))

print("--- 006 辞書引数 ---------------------------------------------------------")
def func010(**x):
    return(x)
print(func010(a=1,b=2,c=3))

print("--- 007 import ----------------------------------------------------------")
import mod001
mod001.mod_func_001()

print("--- 008 モジュール更新時 -------------------------------------------------")
import importlib
importlib.reload(mod001)

print("--- 009 パッケージ -------------------------------------------------------")
from pac001 import mod002
mod002.mod_func_002()

from pac002.mod003 import mod_func_003
mod_func_003()
